apache/nuttx/arch/arm/src/tiva/chip/tm4c129x_syscontrol.h
/* System Control Register Bit Definitions **************************************************/
/* System Control Registers (System Control Offset) */

/* Device Identification 0 */
#define SYSCON_DID0_
/* Device Identification 1 */
#define SYSCON_DID1_
/* Power-Temp Brown Out Control */
#define SYSCON_PTBOCTL_
/* Raw Interrupt Status */
#define SYSCON_RIS_
/* Interrupt Mask Control */
#define SYSCON_IMC_
/* Masked Interrupt Status and Clear */
#define SYSCON_MISC_
/* Reset Cause */
#define SYSCON_RESC_
/* Power-Temperature Cause */
#define SYSCON_PWRTC_
/* NMI Cause Register */
#define SYSCON_NMIC_
/* Main Oscillator Control */
#define SYSCON_MOSCCTL_
/* Run and Sleep Mode Configuration Register */
#define SYSCON_RSCLKCFG_
/* Memory Timing Parameter Register 0 */
#define SYSCON_MEMTIM0_
/* Alternate Clock Configuration */
#define SYSCON_ALTCLKCFG_
/* Deep Sleep Clock Configuration Register */
#define SYSCON_DSCLKCFG_
/* Divisor and Source Clock Configuration */
#define SYSCON_DIVSCLK_
/* System Properties */
#define SYSCON_SYSPROP_
/* Precision Internal Oscillator Calibration */
#define SYSCON_PIOSCCAL_
/* Precision Internal Oscillator Statistics */
#define SYSCON_PIOSCSTAT_
/* PLL Frequency 0 */
#define SYSCON_PLLFREQ0_
/* PLL Frequency 1 */
#define SYSCON_PLLFREQ1_
/* PLL Status */
#define SYSCON_PLLSTAT_
/* Sleep Power Configuration */
#define SYSCON_SLPPWRCFG_
/* Deep-Sleep Power Configuration */
#define SYSCON_DSLPPWRCFG_
/* Non-Volatile Memory Information */
#define SYSCON_NVMSTAT_
/* LDO Sleep Power Control */
#define SYSCON_LDOSPCTL_
/* LDO Sleep Power Calibration */
#define SYSCON_LDOSPCAL_
/* LDO Deep-Sleep Power Control */
#define SYSCON_LDODPCTL_
/* LDO Deep-Sleep Power Calibration */
#define SYSCON_LDODPCAL_
/* Sleep / Deep-Sleep Power Mode Status */
#define SYSCON_SDPMST_
/* Reset Behavior Control Register */
#define SYSCON_RESBEHAVCTL_
/* Hardware System Service Request */
#define SYSCON_HSSR_
/* USB Power Domain Status */
#define SYSCON_USBPDS_
/* USB Memory Power Control */
#define SYSCON_USBMPC_
/* Ethernet MAC Power Domain Status */
#define SYSCON_EMACPDS_
/* Ethernet MAC Memory Power Control */
#define SYSCON_EMACMPC_
/* LCD Power Domain Status */
#define SYSCON_LCDPDS_
/* LCD Memory Power Control */
#define SYSCON_LCDMPC_
/* CAN 0 Power Domain Status */
#define SYSCON_CAN0PDS_
/* CAN 0 Memory Power Control */
#define SYSCON_CAN0MPC_
/* CAN 1 Power Domain Status */
#define SYSCON_CAN1PDS_
/* CAN 1 Memory Power Control */
#define SYSCON_CAN1MPC_
/* Watchdog Timer Peripheral Present */
#define SYSCON_PPWD_
/* 16/32-Bit Timer Peripheral Present */
#define SYSCON_PPTIMER_
/* GPIO Peripheral Present */
#define SYSCON_PPGPIO_
/* uDMA Peripheral Present */
#define SYSCON_PPDMA_
/* EPI Peripheral Present */
#define SYSCON_PPEPI_
/* Hibernation Peripheral Present */
#define SYSCON_PPHIB_
/* UART Peripheral Present */
#define SYSCON_PPUART_
/* SSI Peripheral Present */
#define SYSCON_PPSSI_
/* I2C Peripheral Present */
#define SYSCON_PPI2C_
/* USB Peripheral Present */
#define SYSCON_PPUSB_
/* Ethernet PHY Peripheral Present */
#define SYSCON_PPEPHY_
/* CAN Peripheral Present */
#define SYSCON_PPCAN_
/* ADC Peripheral Present */
#define SYSCON_PPADC_
/* ACMP Peripheral Present */
#define SYSCON_PPACMP_
/* PWM Peripheral Present */
#define SYSCON_PPPWM_
/* QE Interface Peripheral Present */
#define SYSCON_PPQEI_
/* Low Pin Count Interface Peripheral Present */
#define SYSCON_PPLPC_
/* Platform Environment Control Interface Peripheral Present */
#define SYSCON_PPPECI_
/* Fan Control Peripheral Present */
#define SYSCON_PPFAN_
/* EEPROM Peripheral Present */
#define SYSCON_PPEEPROM_
/* 32/64-Bit Wide Timer Peripheral Present */
#define SYSCON_PPWTIMER_
/* Remote Temperature Sensor Peripheral Present */
#define SYSCON_PPRTS_
/* CRC/Crypto Modules Peripheral Present */
#define SYSCON_PPCCM_
/* LCD Peripheral Present */
#define SYSCON_PPLCD_
/* 1-Wire Peripheral Present */
#define SYSCON_PPOWIRE_
/* Ethernet MAC Peripheral Present */
#define SYSCON_PPEMAC_
/* Power Regulator Bus Peripheral Present */
#define SYSCON_PPPRB_
/* Human Interface Master Peripheral Present */
#define SYSCON_PPHIM_
/* Watchdog Timer Software Reset */
#define SYSCON_SRWD_
/* 16/32-Bit Timer Software Reset */
#define SYSCON_SRTIMER_
/* GPIO Software Reset */
#define SYSCON_SRGPIO_
/* uDMA Software Reset */
#define SYSCON_SRDMA_
/* EPI Software Reset */
#define SYSCON_SREPI_
/* Hibernation Software Reset */
#define SYSCON_SRHIB_
/* UART Software Reset */
#define SYSCON_SRUART_
/* SSI Software Reset */
#define SYSCON_SRSSI_
/* I2C Software Reset */
#define SYSCON_SRI2C_
/* USB Software Reset */
#define SYSCON_SRUSB_
/* Ethernet PHY Software Reset */
#define SYSCON_SREPHY_
/* CAN Software Reset */
#define SYSCON_SRCAN_
/* ADC Software Reset */
#define SYSCON_SRADC_
/* ACMP Software Reset */
#define SYSCON_SRACMP_
/* PWM Software Reset */
#define SYSCON_SRPWM_
/* QE Interface Software Reset */
#define SYSCON_SRQEI_
/* EEPROM Software Reset */
#define SYSCON_SREEPROM_
/* CRC/Crypto Modules Software Reset */
#define SYSCON_SRCCM_
/* LCD Controller Software Reset */
#define SYSCON_SRLCD_
/* 1-Wire Software Reset */
#define SYSCON_SROWIRE_
/* Ethernet MAC Software Reset */
#define SYSCON_SREMAC_
/* Watchdog Timer Run Mode Clock Gating Control */
#define SYSCON_RCGCWD_
/* 16/32-Bit Timer Run Mode Clock Gating Control */
#define SYSCON_RCGCTIMER_
/* GPIO Run Mode Clock Gating Control */
#define SYSCON_RCGCGPIO_
/* uDMA Run Mode Clock Gating Control */
#define SYSCON_RCGCDMA_
/* EPI Run Mode Clock Gating Control */
#define SYSCON_RCGCEPI_
/* Hibernation Run Mode Clock Gating Control */
#define SYSCON_RCGCHIB_
/* UART Run Mode Clock Gating Control */
#define SYSCON_RCGCUART_
/* SSI Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCSSI_
/* I2C Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCI2C_
/* USB Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCUSB_
/* Ethernet PHY Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCEPHY_
/* CAN RunMode Clock Gating Control */
#define TIVA_SYSCON_RCGCCAN_
/* ADC Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCADC_
/* ACMP Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCACMP_
/* PWM Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCPWM_
/* QE Interface Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCQEI_
/* EEPROM Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCEEPROM_
/* CRC/CryptoModules RunMode ClockGating Control */
#define TIVA_SYSCON_RCGCCCM_
/* LCD Controller Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCLCD_
/* 1-Wire Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCOWIRE_
/* Ethernet MAC Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCEMAC_
/* Watchdog Timer Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCWD_
/* 16/32-Bit Timer Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCTIMER_
/* GPIO Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCGPIO_
/* uDMA Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCDMA_
/* EPI Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCEPI_
/* Hibernation Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCHIB_
/* UART Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCUART_
/* SSI Sleep Mode Clock GatingControl */
#define TIVA_SYSCON_SCGCSSI_
/* I2C Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCI2C_
/* USB Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCUSB_
/* Ethernet PHY Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCEPHY_
/* CAN Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCCAN_
/* ADC Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCADC_
/* ACMP Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCACMP_
/* PulseWidthModulator Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCPWM_
/* QE Interface Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCQEI_
/* EEPROM Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCEEPROM_
/* CRC/Crypto Modules Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCCCM_
/* LCD Controller Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCLCD_
/* 1-Wire Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCOWIRE_
/* Ethernet MAC Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_SCGCEMAC_
/* Watchdog Timer Deep-SleepMode Clock Gating Control */
#define TIVA_SYSCON_DCGCWD_
/* 16/32-Bit Timer Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCTIMER_
/* GPIO Deep-Sleep Mode Clock */
#define TIVA_SYSCON_DCGCGPIO_
/* uDMA Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCDMA_
/* EPI Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCEPI_
/* Hibernation Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCHIB_
/* UART Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCUART_
/* SSI Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCSSI_
/* I2C Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCI2C_
/* USB Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCUSB_
/* Ethernet PHY Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCEPHY_
/* CAN Deep-SleepMode Clock Gating Control */
#define TIVA_SYSCON_DCGCCAN_
/* ADC Deep-Sleep Mode ClockGating Control */
#define TIVA_SYSCON_DCGCADC_
/* ACMP Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCACMP_
/* PWM Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCPWM_
/* QE Interface Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCQEI_
/* EEPROM Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCEEPROM_
/* CRC/Crypto Modules Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCCCM_
/* LCD Controller Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCLCD_
/* 1-Wire Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCOWIRE_
/* Ethernet MAC Deep-Sleep Mode Clock Gating Control */
#define TIVA_SYSCON_DCGCEMAC_
/* Watchdog Timer Power Control */
#define TIVA_SYSCON_PCWD_
/* 16/32-Bit Timer Power Control */
#define TIVA_SYSCON_PCTIMER_
/* GPIO Power Control */
#define TIVA_SYSCON_PCGPIO_
/* uDMA Power Control */
#define TIVA_SYSCON_PCDMA_
/* External Peripheral Interface Power Control */
#define TIVA_SYSCON_PCEPI_
/* Hibernation Power Control */
#define TIVA_SYSCON_PCHIB_
/* UART Power Control */
#define TIVA_SYSCON_PCUART_
/* SSI Power Control */
#define TIVA_SYSCON_PCSSI_
/* I2C Power Control */
#define TIVA_SYSCON_PCI2C_
/* USB Power Control */
#define TIVA_SYSCON_PCUSB_
/* Ethernet PHY Power Control */
#define TIVA_SYSCON_PCEPHY_
/* CAN Power Control */
#define TIVA_SYSCON_PCCAN_
/* ADC Power Control */
#define TIVA_SYSCON_PCADC_
/* ACMP Power Control */
#define TIVA_SYSCON_PCACMP_
/* PWM Power Control */
#define TIVA_SYSCON_PCPWM_
/* QE Interface Power Control */
#define TIVA_SYSCON_PCQEI_
/* EEPROM Power Control */
#define TIVA_SYSCON_PCEEPROM_
/* CRC/Crypto Modules Power Control */
#define TIVA_SYSCON_PCCCM_
/* LCD Controller Power Control */
#define TIVA_SYSCON_PCLCD_
/* 1-Wire Power Control */
#define TIVA_SYSCON_PCOWIRE_
/* Ethernet MAC Power Control */
#define TIVA_SYSCON_PCEMAC_
/* Watchdog Timer Peripheral Ready */
#define TIVA_SYSCON_PRWD_
/* 16/32-Bit Timer Peripheral Ready */
#define TIVA_SYSCON_PRTIMER_
/* GPIO Peripheral Ready */
#define TIVA_SYSCON_PRGPIO_
/* uDMA Peripheral Ready */
#define TIVA_SYSCON_PRDMA_
/* EPI Peripheral Ready */
#define TIVA_SYSCON_PREPI_
/* Hibernation Peripheral Ready */
#define TIVA_SYSCON_PRHIB_
/* UART Peripheral Ready */
#define TIVA_SYSCON_PRUART_
/* SSI Peripheral Ready */
#define TIVA_SYSCON_PRSSI_
/* I2C Peripheral Ready */
#define TIVA_SYSCON_PRI2C_
/* USB Peripheral Ready */
#define TIVA_SYSCON_PRUSB_
/* Ethernet PHY Peripheral Ready */
#define TIVA_SYSCON_PREPHY_
/* CAN Peripheral Ready */
#define TIVA_SYSCON_PRCAN_
/* ADC Peripheral Ready */
#define TIVA_SYSCON_PRADC_
/* ACMP Peripheral Ready */
#define TIVA_SYSCON_PRACMP_
/* PWM Peripheral Ready */
#define TIVA_SYSCON_PRPWM_
/* QE Interface Peripheral Ready */
#define TIVA_SYSCON_PRQEI_
/* EEPROM Peripheral Ready */
#define TIVA_SYSCON_PREEPROM_
/* CRC/Crypto Modules Peripheral Ready */
#define TIVA_SYSCON_PRCCM_
/* LCD Controller Peripheral Ready */
#define TIVA_SYSCON_PRLCD_
/* 1-Wire Peripheral Ready */
#define TIVA_SYSCON_PROWIRE_
/* Ethernet MAC Peripheral Ready */
#define TIVA_SYSCON_PREMAC_
/* Unique ID 0 */
#define TIVA_SYSCON_UNIQUEID0_
/* Unique ID 1 */
#define TIVA_SYSCON_UNIQUEID1_
/* Unique ID 2 */
#define TIVA_SYSCON_UNIQUEID2_
/* Unique ID 3 */
#define TIVA_SYSCON_UNIQUEID3_

/* CCM System Control Registers (CCM Control Offset) */

/* Cryptographic Modules Clock Gating Request */
#define TIVA_SYSCON_CCMCGREQ_

/********************************************************************************************
 * Public Types
 ********************************************************************************************/

/********************************************************************************************
 * Public Data
 ********************************************************************************************/

/********************************************************************************************
 * Public Functions
 ********************************************************************************************/

#endif /* __ARCH_ARM_SRC_TIVA_CHIP_TM4C129X_SYSCONTROL_H */
